[Timeout] ArrowFunction
src/components/BootstrapIcons.js:3:28
 import React, { useState } from "react";
 
-export const ChevronDown = (props) => <i data-testid="chevron-down" className="bi bi-chevron-down" {...props}></i>;
+export const ChevronDown = () => undefined;
 
 export const MobileNavToggle = React.forwardRef(({onClick, ...props}, ref) => {

[Killed] BlockStatement
src/components/BootstrapIcons.js:5:79
 
 export const ChevronDown = (props) => <i data-testid="chevron-down" className="bi bi-chevron-down" {...props}></i>;
 
-export const MobileNavToggle = React.forwardRef(({onClick, ...props}, ref) => {
-  const [hasBeenToggled, setHasBeenToggled] = useState(false);
-
-  const handleClick = (e) => {
-    setHasBeenToggled(!hasBeenToggled);
-    onClick(e);
-  }
-
-  return (<i
-    data-testid="mobile-nav-toggle"
-    ref={ref}
-    className={`bi ${hasBeenToggled ? 'bi-x' : 'bi-list'} mobile-nav-toggle`}
-    onClick={handleClick}
-    {...props}></i>
-  );
-});
+export const MobileNavToggle = React.forwardRef(({onClick, ...props}, ref) => {});
 
killedBy: MobileNavToggle renders with default props
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="mobile-nav-toggle"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
src/components/BootstrapIcons.js:6:56
 export const ChevronDown = (props) => <i data-testid="chevron-down" className="bi bi-chevron-down" {...props}></i>;
 
 export const MobileNavToggle = React.forwardRef(({onClick, ...props}, ref) => {
-  const [hasBeenToggled, setHasBeenToggled] = useState(false);
+  const [hasBeenToggled, setHasBeenToggled] = useState(true);
 
   const handleClick = (e) => {
killedBy: MobileNavToggle toggles icon when clicked
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/components/BootstrapIcons.js:8:30
 export const MobileNavToggle = React.forwardRef(({onClick, ...props}, ref) => {
   const [hasBeenToggled, setHasBeenToggled] = useState(false);
 
-  const handleClick = (e) => {
-    setHasBeenToggled(!hasBeenToggled);
-    onClick(e);
-  }
+  const handleClick = (e) => {}
 
   return (<i
killedBy: MobileNavToggle passes props as expected
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Timeout] BooleanLiteral
src/components/BootstrapIcons.js:9:23
   const [hasBeenToggled, setHasBeenToggled] = useState(false);
 
   const handleClick = (e) => {
-    setHasBeenToggled(!hasBeenToggled);
+    setHasBeenToggled(hasBeenToggled);
     onClick(e);
   }
