[Killed] BlockStatement
src/components/Header.js:41:18
 
 export const Header = () => {
   const headerRef = useRef(null);
-  useEffect(()=> {
-    /**
-     * Adapted from: https://github.com/matneyx/matneyx.github.io/blob/BootstrapMade-DevFolio-Free-Template/assets/js/main.js#L82
-     */
-
-     const headerScrolled = () => {
-       if (window.scrollY > 100) {
-         headerRef.current.classList.add('header-scrolled')
-       } else {
-         headerRef.current.classList.remove('header-scrolled')
-       }
-     }
-     window.addEventListener('load', headerScrolled)
-     window.addEventListener('scroll', headerScrolled);
-
-     return (() => {
-       window.removeEventListener('load', headerScrolled)
-       window.removeEventListener('scroll', headerScrolled);
-     })
-  });
+  useEffect(()=> {});
 
   /**
killedBy: scrolling the window updates the header class
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/components/Header.js:46:35
      * Adapted from: https://github.com/matneyx/matneyx.github.io/blob/BootstrapMade-DevFolio-Free-Template/assets/js/main.js#L82
      */
 
-     const headerScrolled = () => {
-       if (window.scrollY > 100) {
-         headerRef.current.classList.add('header-scrolled')
-       } else {
-         headerRef.current.classList.remove('header-scrolled')
-       }
-     }
+     const headerScrolled = () => {}
      window.addEventListener('load', headerScrolled)
      window.addEventListener('scroll', headerScrolled);
killedBy: scrolling the window updates the header class
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] EqualityOperator
src/components/Header.js:47:12
      */
 
      const headerScrolled = () => {
-       if (window.scrollY > 100) {
+       if (window.scrollY >= 100) {
          headerRef.current.classList.add('header-scrolled')
        } else {
killedBy: scrolling the window updates the header class
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] ConditionalExpression
src/components/Header.js:47:12
      */
 
      const headerScrolled = () => {
-       if (window.scrollY > 100) {
+       if (true) {
          headerRef.current.classList.add('header-scrolled')
        } else {
killedBy: scrolling the window updates the header class
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] BlockStatement
src/components/Header.js:49:15
      const headerScrolled = () => {
        if (window.scrollY > 100) {
          headerRef.current.classList.add('header-scrolled')
-       } else {
-         headerRef.current.classList.remove('header-scrolled')
-       }
+       } else {}
      }
      window.addEventListener('load', headerScrolled)
killedBy: scrolling the window updates the header class
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] BlockStatement
src/components/Header.js:56:20
      window.addEventListener('load', headerScrolled)
      window.addEventListener('scroll', headerScrolled);
 
-     return (() => {
-       window.removeEventListener('load', headerScrolled)
-       window.removeEventListener('scroll', headerScrolled);
-     })
+     return (() => {})
   });
 
killedBy: scrolling the window updates the header class
statusReason: TypeError: Cannot read properties of null (reading 'classList')
