[Survived] ArrowFunction
src/components/NavBar.js:11:37
 import { ChevronDown, MobileNavToggle } from './BootstrapIcons';
 import './../assets/css/navbar.css'
 
-const ListAnchor = React.forwardRef(({href, className, children, key,...rest}, ref) =>
-  <li><a href={href} className={className} ref={ref} {...rest}>{children}</a></li>);
+const ListAnchor = React.forwardRef(() => undefined);
 
 const NavListItem = React.forwardRef((props,ref) => {

[Survived] BlockStatement
src/components/NavBar.js:19:52
 
   const compiledClassName = ['scrollto'].concat(className.split(' ')).join(' ');
 
-  const handleClick = (e, navRef, navToggleRef) => {
-    e.preventDefault()
-
-    if(navRef.current.classList.contains('navbar-mobile')) {
-      navRef.current.classList.remove('navbar-mobile');
-      navToggleRef.current.classList.toggle('bi-list');
-      navToggleRef.current.classList.toggle('bi-x');
-    }
-  }
+  const handleClick = (e, navRef, navToggleRef) => {}
 
   return (

[Survived] ConditionalExpression
src/components/NavBar.js:22:8
   const handleClick = (e, navRef, navToggleRef) => {
     e.preventDefault()
 
-    if(navRef.current.classList.contains('navbar-mobile')) {
+    if(true) {
       navRef.current.classList.remove('navbar-mobile');
       navToggleRef.current.classList.toggle('bi-list');

[Survived] BlockStatement
src/components/NavBar.js:22:60
   const handleClick = (e, navRef, navToggleRef) => {
     e.preventDefault()
 
-    if(navRef.current.classList.contains('navbar-mobile')) {
-      navRef.current.classList.remove('navbar-mobile');
-      navToggleRef.current.classList.toggle('bi-list');
-      navToggleRef.current.classList.toggle('bi-x');
-    }
+    if(navRef.current.classList.contains('navbar-mobile')) {}
   }
 

[Survived] ArrowFunction
src/components/NavBar.js:35:16
       className={compiledClassName}
       href={href}
       ref={ref}
-      onClick={e => handleClick(e, navbarRef, mobileNavToggleRef)}
+      onClick={() => undefined}
       {...rest}
     >

[Survived] BlockStatement
src/components/NavBar.js:46:77
 // The forwardRef is important!!
 // Dropdown needs access to the DOM node in order to position the Menu
 // TODO: Figure out how to get hovering to work so you don't have to click!
-const CustomToggle = React.forwardRef(({ children, onClick, href }, ref) => {
-  const handleClick = (e) => {
-    e.preventDefault();
-    onClick(e);
-  }
-
-  return (<a
-    className='nav-link scrollto'
-    href={href}
-    ref={ref}
-    onClick={handleClick}
-  >
-    {children}<ChevronDown />
-  </a>
-)});
+const CustomToggle = React.forwardRef(({ children, onClick, href }, ref) => {});
 
 export const NavBar = () => {

[Survived] BlockStatement
src/components/NavBar.js:47:30
 // Dropdown needs access to the DOM node in order to position the Menu
 // TODO: Figure out how to get hovering to work so you don't have to click!
 const CustomToggle = React.forwardRef(({ children, onClick, href }, ref) => {
-  const handleClick = (e) => {
-    e.preventDefault();
-    onClick(e);
-  }
+  const handleClick = (e) => {}
 
   return (<a

[Survived] ArrayDeclaration
src/components/NavBar.js:65:30
 export const NavBar = () => {
   const navbarRef = useRef(null);
   const mobileNavToggleRef = useRef(null);
-  const navLinkRefs = useRef([]);
+  const navLinkRefs = useRef(["Stryker was here"]);
 
   useEffect(() => {

[Survived] BlockStatement
src/components/NavBar.js:67:19
   const mobileNavToggleRef = useRef(null);
   const navLinkRefs = useRef([]);
 
-  useEffect(() => {
-    // an array of refs doesn't clean itself out when a ref is no longer viable
-    navLinkRefs.current = navLinkRefs.current
-      .filter(x => x)
-      .filter(x => x.scrollHeight !== 0 && x.scrollWidth !== 0)
-  }, [navLinkRefs])
+  useEffect(() => {}, [navLinkRefs])
 
   useEffect(() => {

[Survived] MethodExpression
src/components/NavBar.js:69:27
 
   useEffect(() => {
     // an array of refs doesn't clean itself out when a ref is no longer viable
-    navLinkRefs.current = navLinkRefs.current
-      .filter(x => x)
+    navLinkRefs.current = navLinkRefs.current
       .filter(x => x.scrollHeight !== 0 && x.scrollWidth !== 0)
   }, [navLinkRefs])

[Survived] MethodExpression
src/components/NavBar.js:69:27
 
   useEffect(() => {
     // an array of refs doesn't clean itself out when a ref is no longer viable
-    navLinkRefs.current = navLinkRefs.current
-      .filter(x => x)
-      .filter(x => x.scrollHeight !== 0 && x.scrollWidth !== 0)
+    navLinkRefs.current = navLinkRefs.current.filter(x => x)
   }, [navLinkRefs])
 

[Survived] ArrowFunction
src/components/NavBar.js:70:15
   useEffect(() => {
     // an array of refs doesn't clean itself out when a ref is no longer viable
     navLinkRefs.current = navLinkRefs.current
-      .filter(x => x)
+      .filter(() => undefined)
       .filter(x => x.scrollHeight !== 0 && x.scrollWidth !== 0)
   }, [navLinkRefs])

[Survived] ArrowFunction
src/components/NavBar.js:71:15
     // an array of refs doesn't clean itself out when a ref is no longer viable
     navLinkRefs.current = navLinkRefs.current
       .filter(x => x)
-      .filter(x => x.scrollHeight !== 0 && x.scrollWidth !== 0)
+      .filter(() => undefined)
   }, [navLinkRefs])
 

[Survived] EqualityOperator
src/components/NavBar.js:71:20
     // an array of refs doesn't clean itself out when a ref is no longer viable
     navLinkRefs.current = navLinkRefs.current
       .filter(x => x)
-      .filter(x => x.scrollHeight !== 0 && x.scrollWidth !== 0)
+      .filter(x => x.scrollHeight === 0 && x.scrollWidth !== 0)
   }, [navLinkRefs])
 

[Survived] ArrayDeclaration
src/components/NavBar.js:72:6
     navLinkRefs.current = navLinkRefs.current
       .filter(x => x)
       .filter(x => x.scrollHeight !== 0 && x.scrollWidth !== 0)
-  }, [navLinkRefs])
+  }, [])
 
   useEffect(() => {

[Survived] BlockStatement
src/components/NavBar.js:80:37
       */
 
     // TODO: This can probably be handled with state
-    const navbarlinksActive = () => {
-      let position = window.scrollY + 200
-      navLinkRefs.current.forEach(navbarlink => {
-        if (!navbarlink.hash) return
-        let section = select(navbarlink.hash)
-        if (!section) return
-        if (position >= section.offsetTop && position <= (section.offsetTop + section.offsetHeight)) {
-          navbarlink.classList.add('active')
-        } else {
-          navbarlink.classList.remove('active')
-        }
-      })
-    }
+    const navbarlinksActive = () => {}
 
     window.addEventListener('load', navbarlinksActive);

[Survived] ArithmeticOperator
src/components/NavBar.js:81:22
 
     // TODO: This can probably be handled with state
     const navbarlinksActive = () => {
-      let position = window.scrollY + 200
+      let position = window.scrollY - 200
       navLinkRefs.current.forEach(navbarlink => {
         if (!navbarlink.hash) return

[Survived] BlockStatement
src/components/NavBar.js:82:49
     // TODO: This can probably be handled with state
     const navbarlinksActive = () => {
       let position = window.scrollY + 200
-      navLinkRefs.current.forEach(navbarlink => {
-        if (!navbarlink.hash) return
-        let section = select(navbarlink.hash)
-        if (!section) return
-        if (position >= section.offsetTop && position <= (section.offsetTop + section.offsetHeight)) {
-          navbarlink.classList.add('active')
-        } else {
-          navbarlink.classList.remove('active')
-        }
-      })
+      navLinkRefs.current.forEach(navbarlink => {})
     }
 

[Survived] ConditionalExpression
src/components/NavBar.js:83:13
     const navbarlinksActive = () => {
       let position = window.scrollY + 200
       navLinkRefs.current.forEach(navbarlink => {
-        if (!navbarlink.hash) return
+        if (true) return
         let section = select(navbarlink.hash)
         if (!section) return

[Survived] ConditionalExpression
src/components/NavBar.js:83:13
     const navbarlinksActive = () => {
       let position = window.scrollY + 200
       navLinkRefs.current.forEach(navbarlink => {
-        if (!navbarlink.hash) return
+        if (false) return
         let section = select(navbarlink.hash)
         if (!section) return

[Survived] ConditionalExpression
src/components/NavBar.js:85:13
       navLinkRefs.current.forEach(navbarlink => {
         if (!navbarlink.hash) return
         let section = select(navbarlink.hash)
-        if (!section) return
+        if (false) return
         if (position >= section.offsetTop && position <= (section.offsetTop + section.offsetHeight)) {
           navbarlink.classList.add('active')

[Survived] BooleanLiteral
src/components/NavBar.js:85:13
       navLinkRefs.current.forEach(navbarlink => {
         if (!navbarlink.hash) return
         let section = select(navbarlink.hash)
-        if (!section) return
+        if (section) return
         if (position >= section.offsetTop && position <= (section.offsetTop + section.offsetHeight)) {
           navbarlink.classList.add('active')

[Survived] EqualityOperator
src/components/NavBar.js:86:46
         if (!navbarlink.hash) return
         let section = select(navbarlink.hash)
         if (!section) return
-        if (position >= section.offsetTop && position <= (section.offsetTop + section.offsetHeight)) {
+        if (position >= section.offsetTop && position < section.offsetTop + section.offsetHeight) {
           navbarlink.classList.add('active')
         } else {

[Survived] LogicalOperator
src/components/NavBar.js:86:13
         if (!navbarlink.hash) return
         let section = select(navbarlink.hash)
         if (!section) return
-        if (position >= section.offsetTop && position <= (section.offsetTop + section.offsetHeight)) {
+        if (position >= section.offsetTop || position <= section.offsetTop + section.offsetHeight) {
           navbarlink.classList.add('active')
         } else {

[Survived] BlockStatement
src/components/NavBar.js:88:16
         if (!section) return
         if (position >= section.offsetTop && position <= (section.offsetTop + section.offsetHeight)) {
           navbarlink.classList.add('active')
-        } else {
-          navbarlink.classList.remove('active')
-        }
+        } else {}
       })
     }

[Survived] BlockStatement
src/components/NavBar.js:97:18
     window.addEventListener('load', navbarlinksActive);
     document.addEventListener('scroll', navbarlinksActive);
 
-    return(() => {
-      window.removeEventListener('load', navbarlinksActive);
-      document.removeEventListener('scroll', navbarlinksActive);
-    });
+    return(() => {});
   });
 

[Survived] BlockStatement
src/components/NavBar.js:103:43
     });
   });
 
-  const onNavToggleClick = (navbarRef) => {
-    navbarRef.current.classList.toggle('navbar-mobile');
-  }
+  const onNavToggleClick = (navbarRef) => {}
 
   // TODO: Clicking on my dropdown list, in mobile view, just closes the menu

[Survived] BlockStatement
src/components/NavBar.js:108:49
   }
 
   // TODO: Clicking on my dropdown list, in mobile view, just closes the menu
-  const onDropdownItemClick = (e, navbarRef) => {
-    console.log(e);
-
-    if(navbarRef.current.classList.contains('navbar-mobile'))
-    {
-      e.preventDefault()
-      this.nextElementSibling.classList.toggle('dropdown-active')
-    }
-  }
+  const onDropdownItemClick = (e, navbarRef) => {}
 
   const NavItem = (props) =>

[Survived] ConditionalExpression
src/components/NavBar.js:111:8
   const onDropdownItemClick = (e, navbarRef) => {
     console.log(e);
 
-    if(navbarRef.current.classList.contains('navbar-mobile'))
+    if(false)
     {
       e.preventDefault()

[Survived] ConditionalExpression
src/components/NavBar.js:111:8
   const onDropdownItemClick = (e, navbarRef) => {
     console.log(e);
 
-    if(navbarRef.current.classList.contains('navbar-mobile'))
+    if(true)
     {
       e.preventDefault()

[Survived] BlockStatement
src/components/NavBar.js:112:5
     console.log(e);
 
     if(navbarRef.current.classList.contains('navbar-mobile'))
-    {
-      e.preventDefault()
-      this.nextElementSibling.classList.toggle('dropdown-active')
-    }
+    {}
   }
 

[Survived] ArrowFunction
src/components/NavBar.js:118:19
     }
   }
 
-  const NavItem = (props) =>
-    <NavListItem
-      navbarRef={navbarRef}
-      mobileNavToggleRef={mobileNavToggleRef}
-      ref={(el) => navLinkRefs.current.push(el)}
-      {...props}
-    >
-      {props.children}
-    </NavListItem>;
+  const NavItem = () => undefined;
 
   const NavAnchor = (props) =>

[Survived] ArrowFunction
src/components/NavBar.js:122:12
     <NavListItem
       navbarRef={navbarRef}
       mobileNavToggleRef={mobileNavToggleRef}
-      ref={(el) => navLinkRefs.current.push(el)}
+      ref={() => undefined}
       {...props}
     >

[Survived] ArrowFunction
src/components/NavBar.js:128:21
       {props.children}
     </NavListItem>;
 
-  const NavAnchor = (props) =>
-    <NavItem
-      isAnchor={true}
-      {...props}
-    >
-      {props.children}
-    </NavItem>;
+  const NavAnchor = () => undefined;
 
   return (

[Survived] BooleanLiteral
src/components/NavBar.js:130:17
 
   const NavAnchor = (props) =>
     <NavItem
-      isAnchor={true}
+      isAnchor={false}
       {...props}
     >

[Survived] BooleanLiteral
src/components/NavBar.js:137:49
     </NavItem>;
 
   return (
-    <Navbar ref={navbarRef} id="navbar" expand={false} variant={false}>
+    <Navbar ref={navbarRef} id="navbar" expand={true} variant={false}>
       <ul>
         <NavAnchor href='#hero'>Home</NavAnchor>

[Survived] BooleanLiteral
src/components/NavBar.js:137:65
     </NavItem>;
 
   return (
-    <Navbar ref={navbarRef} id="navbar" expand={false} variant={false}>
+    <Navbar ref={navbarRef} id="navbar" expand={false} variant={true}>
       <ul>
         <NavAnchor href='#hero'>Home</NavAnchor>

[Survived] ArrowFunction
src/components/NavBar.js:147:37
         <Dropdown as={NavItem}>
           <Dropdown.Toggle as={CustomToggle}>Dropdown</Dropdown.Toggle>
           <Dropdown.Menu as='ul'>
-            <Dropdown.Item onClick={e => onDropdownItemClick(e, navbarRef)} href='#hello' ref={(el) => navLinkRefs.current.push(el)}>Hello there!</Dropdown.Item>
+            <Dropdown.Item onClick={() => undefined} href='#hello' ref={(el) => navLinkRefs.current.push(el)}>Hello there!</Dropdown.Item>
           </Dropdown.Menu>
         </Dropdown>

[Survived] ArrowFunction
src/components/NavBar.js:147:96
         <Dropdown as={NavItem}>
           <Dropdown.Toggle as={CustomToggle}>Dropdown</Dropdown.Toggle>
           <Dropdown.Menu as='ul'>
-            <Dropdown.Item onClick={e => onDropdownItemClick(e, navbarRef)} href='#hello' ref={(el) => navLinkRefs.current.push(el)}>Hello there!</Dropdown.Item>
+            <Dropdown.Item onClick={e => onDropdownItemClick(e, navbarRef)} href='#hello' ref={() => undefined}>Hello there!</Dropdown.Item>
           </Dropdown.Menu>
         </Dropdown>

[Survived] ArrowFunction
src/components/NavBar.js:152:33
         </Dropdown>
         <NavAnchor href='#contact'>Contact</NavAnchor>
       </ul>
-      <MobileNavToggle onClick={() => onNavToggleClick(navbarRef)} ref={mobileNavToggleRef} />
+      <MobileNavToggle onClick={() => undefined} ref={mobileNavToggleRef} />
     </Navbar>
   );
