[Survived] BooleanLiteral
src/components/sections/Hero.js:85:15
           'I am a morning person... sometimes',
           'I am more than the sum of my parts'
         ],
-        loop: true,
+        loop: false,
         startDelay: 300,
         typeSpeed: 100,

[Survived] BooleanLiteral
src/components/sections/Hero.js:90:25
         typeSpeed: 100,
         backSpeed: 50,
         backDelay: 600,
-        smartBackspace: false,
+        smartBackspace: true,
         shuffle: true
       });

[Survived] BooleanLiteral
src/components/sections/Hero.js:91:18
         backSpeed: 50,
         backDelay: 600,
         smartBackspace: false,
-        shuffle: true
+        shuffle: false
       });
 

[Survived] BlockStatement
src/components/sections/Hero.js:94:20
         shuffle: true
       });
 
-      return () => {
-        typedRef.current.destroy();
-      };
+      return () => {};
   });
 
