[Survived] BlockStatement
src/helperFunctions.js:4:44
 /**
    * Easy selector helper function
    */
-export const select = (el, all = false) => {
-  el = el.trim()
-  if (all) {
-    return [...document.querySelectorAll(el)]
-  } else {
-    return document.querySelector(el)
-  }
-}
+export const select = (el, all = false) => {}
 
 /**

[Survived] BooleanLiteral
src/helperFunctions.js:4:34
 /**
    * Easy selector helper function
    */
-export const select = (el, all = false) => {
+export const select = (el, all = true) => {
   el = el.trim()
   if (all) {

[Survived] MethodExpression
src/helperFunctions.js:5:8
    * Easy selector helper function
    */
 export const select = (el, all = false) => {
-  el = el.trim()
+  el = el
   if (all) {
     return [...document.querySelectorAll(el)]

[Survived] BlockStatement
src/helperFunctions.js:6:12
    */
 export const select = (el, all = false) => {
   el = el.trim()
-  if (all) {
-    return [...document.querySelectorAll(el)]
-  } else {
+  if (all) {} else {
     return document.querySelector(el)
   }

[Survived] ConditionalExpression
src/helperFunctions.js:6:7
    */
 export const select = (el, all = false) => {
   el = el.trim()
-  if (all) {
+  if (true) {
     return [...document.querySelectorAll(el)]
   } else {

[Survived] BlockStatement
src/helperFunctions.js:8:10
   el = el.trim()
   if (all) {
     return [...document.querySelectorAll(el)]
-  } else {
-    return document.querySelector(el)
-  }
+  } else {}
 }
 

[Survived] BooleanLiteral
src/helperFunctions.js:16:46
 /**
  * Easy event listener function
  */
-export const on = (type, el, listener, all = false) => {
+export const on = (type, el, listener, all = true) => {
   let selectEl = select(el, all)
   if (selectEl) {

[Survived] BlockStatement
src/helperFunctions.js:16:56
 /**
  * Easy event listener function
  */
-export const on = (type, el, listener, all = false) => {
-  let selectEl = select(el, all)
-  if (selectEl) {
-    if (all) {
-      selectEl.forEach(e => e.addEventListener(type, listener))
-    } else {
-      selectEl.addEventListener(type, listener)
-    }
-  }
-}
+export const on = (type, el, listener, all = false) => {}
 
  /**

[Survived] BlockStatement
src/helperFunctions.js:18:17
  */
 export const on = (type, el, listener, all = false) => {
   let selectEl = select(el, all)
-  if (selectEl) {
-    if (all) {
-      selectEl.forEach(e => e.addEventListener(type, listener))
-    } else {
-      selectEl.addEventListener(type, listener)
-    }
-  }
+  if (selectEl) {}
 }
 

[Survived] ConditionalExpression
src/helperFunctions.js:18:7
  */
 export const on = (type, el, listener, all = false) => {
   let selectEl = select(el, all)
-  if (selectEl) {
+  if (false) {
     if (all) {
       selectEl.forEach(e => e.addEventListener(type, listener))

[Survived] ConditionalExpression
src/helperFunctions.js:19:9
 export const on = (type, el, listener, all = false) => {
   let selectEl = select(el, all)
   if (selectEl) {
-    if (all) {
+    if (false) {
       selectEl.forEach(e => e.addEventListener(type, listener))
     } else {

[Survived] ConditionalExpression
src/helperFunctions.js:19:9
 export const on = (type, el, listener, all = false) => {
   let selectEl = select(el, all)
   if (selectEl) {
-    if (all) {
+    if (true) {
       selectEl.forEach(e => e.addEventListener(type, listener))
     } else {

[Survived] ArrowFunction
src/helperFunctions.js:20:24
   let selectEl = select(el, all)
   if (selectEl) {
     if (all) {
-      selectEl.forEach(e => e.addEventListener(type, listener))
+      selectEl.forEach(() => undefined)
     } else {
       selectEl.addEventListener(type, listener)

[Survived] BlockStatement
src/helperFunctions.js:21:12
   if (selectEl) {
     if (all) {
       selectEl.forEach(e => e.addEventListener(type, listener))
-    } else {
-      selectEl.addEventListener(type, listener)
-    }
+    } else {}
   }
 }

[Survived] BlockStatement
src/helperFunctions.js:30:33
  /**
    * Scrolls to an element with header offset
    */
-export const scrollto = (el) => {
-  let header = select('#header')
-  let offset = header.offsetHeight
-
-  if (!header.classList.contains('header-scrolled')) {
-    offset -= 16
-  }
-
-  let elementPos = select(el).offsetTop
-  window.scrollTo({
-    top: elementPos - offset,
-    behavior: 'smooth'
-  })
-}
+export const scrollto = (el) => {}
 

[Survived] BooleanLiteral
src/helperFunctions.js:34:7
   let header = select('#header')
   let offset = header.offsetHeight
 
-  if (!header.classList.contains('header-scrolled')) {
+  if (header.classList.contains('header-scrolled')) {
     offset -= 16
   }

[Survived] BlockStatement
src/helperFunctions.js:34:54
   let header = select('#header')
   let offset = header.offsetHeight
 
-  if (!header.classList.contains('header-scrolled')) {
-    offset -= 16
-  }
+  if (!header.classList.contains('header-scrolled')) {}
 
   let elementPos = select(el).offsetTop

[Survived] AssignmentOperator
src/helperFunctions.js:35:5
   let offset = header.offsetHeight
 
   if (!header.classList.contains('header-scrolled')) {
-    offset -= 16
+    offset += 16
   }
 

[Survived] ArithmeticOperator
src/helperFunctions.js:40:10
 
   let elementPos = select(el).offsetTop
   window.scrollTo({
-    top: elementPos - offset,
+    top: elementPos + offset,
     behavior: 'smooth'
   })
